SEMESTER-2/Big Data/big-data-exercises-pxl.gitlab.io-master-public/public/plsql/triggers.org
#+TITLE: Oefeningen PL/SQL - Hoofdstuk 4: Triggers
#+AUTHOR: Robin Wils
#+INCLUDE: "../org-options.org"
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../solarized-dark.min.css"/>
-----
[[file:../index.org][Home]] > [[file:plsql.org][PLSQL]] > Triggers \\
[[https://pxl-college-projects.gitlab.io/big-data-exercises-pxl.gitlab.io/plsql/triggers.org][View org source]]

#+TOC: headlines

** Opgave 1
Zorg ervoor dat onderstaande controles automatisch gebeuren indien
het laagste en/of hoogste salaris wordt aangepast in de tabel jobs:

- als de gebruiker 'student' en/of 'bezoeker' deze aanpassing(en) 
  wil doen dan mag dit niet doorgaan en moet de melding "Je hebt 
  onvoldoende rechten om deze actie uit te voeren!" verschijnen.

- als een andere gebruiker deze aanpassing(en) wil doen dan mag 
  deze doorgaan maar moet volgende waarschuwing getoond worden "Ben 
  je zeker dat je het minimum en/of maximum salaris van één of 
  meerdere jobs wil aanpassen? Indien niet voer dan onmiddellijk een 
  ROLLBACK uit!" 

Bewaar als trigger_oef1.sql

#+BEGIN_SRC plsql
CREATE OR REPLACE TRIGGER salary_jobs_trigger
  BEFORE UPDATE OF min_salary, max_salary ON jobs
BEGIN
  IF USER IN ('STUDENT','BEZOEKER') 
  THEN 
    RAISE_APPLICATION_ERROR(
      -20000, 
      'Je hebt onvoldoende rechten om deze actie uit te voeren!'
    );
  ELSE
    DBMS_OUTPUT.PUT_LINE(
      'Ben je zeker dat je het minimum en/of maximum ' || 
      'salaris van één of meerdere jobs wil aanpassen? ' ||
      'Indien niet voer dan een ROLLBACK uit!'
    );
  END IF;
  END;
/
#+END_SRC
[[file:../sql-files/triggers/trigger_oef1.sql][sql bestand]]

Je kan triggers aanmaken via het volgende commando:
#+BEGIN_SRC
SQL> START <filepath>/trigger_naam
#+END_SRC

Je kan de trigger functie testen via:
#+BEGIN_SRC
SQL> UPDATE jobs set min_salary = 0 WHERE job_id = 'SA_REP';
#+END_SRC

** Opgave 2 
Schrijf een database trigger waardoor bijgehouden wordt wie, wanneer,
welke bewerking (insert, update of delete) op de tabel job_history 
heeft uitgevoerd. Maak daarvoor de tabel log_history aan met de 
volgende kolommen: log_user, log_datum, log_tijd, log_actie. \\
Bewaar als trigger_oef2.sql.

#+BEGIN_SRC plsql
CREATE TABLE log_history
(
  log_user VARCHAR2(30), 
  log_datum DATE, 
  log_tijd TIMESTAMP, 
  log_actie VARCHAR2(15)
);

CREATE OR REPLACE TRIGGER job_history_trigger
   AFTER INSERT OR UPDATE OR DELETE ON job_history
DECLARE
   v_action VARCHAR2(15) ;
BEGIN
  IF INSERTING THEN
    v_action := 'INSERT';
  ELSIF UPDATING THEN
    v_action := 'UPDATE';
  ELSE
    v_action := 'DELETE';
  END IF;
 
  INSERT INTO log_history
    VALUES(
      USER, 
      SYSDATE,
      SYSTIMESTAMP, 
      v_action
    );     
  END;
/
#+END_SRC

/(Ik denk dat je tijdens het examen oefening best de create table buiten 
het bestand doet, of in een aparte sql-file zou ook kunnen.)/

[[file:../sql-files/triggers/trigger_oef2.sql][sql bestand]]

Je kan de trigger functie testen via:
#+BEGIN_SRC
SQL> INSERT INTO job_history VALUES(127, '14-JAN-99', SYSDATE, 'ST_CLERK', 50);
SQL> SELECT * FROM job_history;
#+END_SRC

** Opgave 3 WERKT NIET
Schrijf een trigger die ervoor zorgt : 
- dat maandlonen enkel op maandag tussen 9:00 en 17:00 kunnen aangepast worden. 
- dat in het weekend geen employees verwijderd of toegevoegd kunnen worden.

Bewaar als trigger_oef3.sql 

_Tip:_ om de tijd uit de systeemdatum te halen gebruik je de functie to_char 
met als formaat 'hh24:mi:ss'.

/Denk er aan dat zondag dag 1 is in PLSQL./

#+BEGIN_SRC plsql
CREATE OR REPLACE TRIGGER month_loan_trigger
  BEFORE 
    UPDATE OF salary
    OR DELETE
    OR INSERT ON employees
DECLARE
  v_hour varchar2(8);
BEGIN
  IF DELETING OR INSERTING THEN
    IF 
      TO_CHAR(SYSDATE, 'D') = 7 
      OR TO_CHAR(SYSDATE, 'D') = 1 
    THEN
      RAISE_APPLICATION_ERROR(
        -20000, 
        'Can't add or delete salary during weekends.'
      );
    END IF;
  ELSE
    v_hour := TO_CHAR(SYSDATE,'hh24:mi:ss');
    IF
      TO_CHAR(SYSDATE, 'd') != 2 
      OR v_hour < '09:00:00' 
      OR v_hour > '17:00:00'
    THEN
      RAISE_APPLICATION_ERROR(
        -20000,  
        'Can't edit salary, ' || 
        'can only edit during Mondays during 9:00 - 17:00'
      );
    END IF;
  END IF;
  END;
/
#+END_SRC
[[file:../sql-files/triggers/trigger_oef3.sql][sql bestand]]

Je kan de trigger functie testen via:
#+BEGIN_SRC
SQL> DELETE FROM employees WHERE employee_id = 205;
SQL> INSERT INTO employees (salary) VALUES (10000);
#+END_SRC

/Het kan handig zijn om de systeemdatum van je PC tijdelijk te wijzigen./

[[file:../index.org][Home]] > [[file:plsql.org][PLSQL]] > Triggers
