SEMESTER-2/Big Data/big-data-exercises-pxl.gitlab.io-master-public/public/plsql/triggers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-14 Wed 16:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Oefeningen PL/SQL - Hoofdstuk 4: Triggers</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Robin Wils" />
<link rel="stylesheet" type="text/css" href="../solarized-dark.min.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Oefeningen PL/SQL - Hoofdstuk 4: Triggers</h1>
<hr />
<p>
<a href="../index.html">Home</a> &gt; <a href="plsql.html">PLSQL</a> &gt; Triggers <br />
<a href="https://pxl-college-projects.gitlab.io/big-data-exercises-pxl.gitlab.io/plsql/triggers.org">View org source</a>
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org57762bc">Opgave 1</a></li>
<li><a href="#orge268754">Opgave 2</a></li>
<li><a href="#orgab774e6">Opgave 3 WERKT NIET</a></li>
<li><a href="#org0add6de">Opgave 4</a></li>
<li><a href="#orgce837ed">Opgave 5</a></li>
<li><a href="#orgd0306ec">Opgave 6</a></li>
<li><a href="#org8ded561">Opgave 7 NIET DEFTIG GETEST</a></li>
</ul>
</div>
</div>

<div id="outline-container-org57762bc" class="outline-2">
<h2 id="org57762bc">Opgave 1</h2>
<div class="outline-text-2" id="text-org57762bc">
<p>
Zorg ervoor dat onderstaande controles automatisch gebeuren indien
het laagste en/of hoogste salaris wordt aangepast in de tabel jobs:
</p>

<ul class="org-ul">
<li>als de gebruiker 'student' en/of 'bezoeker' deze aanpassing(en) 
wil doen dan mag dit niet doorgaan en moet de melding "Je hebt 
onvoldoende rechten om deze actie uit te voeren!" verschijnen.</li>

<li>als een andere gebruiker deze aanpassing(en) wil doen dan mag 
deze doorgaan maar moet volgende waarschuwing getoond worden "Ben 
je zeker dat je het minimum en/of maximum salaris van één of 
meerdere jobs wil aanpassen? Indien niet voer dan onmiddellijk een 
ROLLBACK uit!"</li>
</ul>

<p>
Bewaar als trigger_oef1.sql
</p>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">OR</span> REPLACE <span style="color: #DD6F48;">TRIGGER</span> <span style="color: #A89984;">salary_jobs_trigger</span>
  <span style="color: #DD6F48;">BEFORE</span> <span style="color: #DD6F48;">UPDATE</span> <span style="color: #DD6F48;">OF</span> min_salary, max_salary <span style="color: #DD6F48;">ON</span> jobs
<span style="color: #DD6F48;">BEGIN</span>
  IF <span style="color: #FE8019;">USER</span> <span style="color: #DD6F48;">IN</span> (<span style="color: #528B8B;">'STUDENT'</span>,<span style="color: #528B8B;">'BEZOEKER'</span>) 
  <span style="color: #DD6F48;">THEN</span> 
    RAISE_APPLICATION_ERROR(
      -20000, 
      <span style="color: #528B8B;">'Je hebt onvoldoende rechten om deze actie uit te voeren!'</span>
    );
  <span style="color: #DD6F48;">ELSE</span>
    DBMS_OUTPUT.PUT_LINE(
      <span style="color: #528B8B;">'Ben je zeker dat je het minimum en/of maximum '</span> || 
      <span style="color: #528B8B;">'salaris van &#233;&#233;n of meerdere jobs wil aanpassen? '</span> ||
      <span style="color: #528B8B;">'Indien niet voer dan een ROLLBACK uit!'</span>
    );
  <span style="color: #DD6F48;">END</span> IF;
  <span style="color: #DD6F48;">END</span>;
/
</pre>
</div>
<p>
<a href="../sql-files/triggers/trigger_oef1.sql">sql bestand</a>
</p>

<p>
Je kan triggers aanmaken via het volgende commando:
</p>
<pre class="example">
SQL&gt; START &lt;filepath&gt;/trigger_naam
</pre>

<p>
Je kan de trigger functie testen via:
</p>
<pre class="example">
SQL&gt; UPDATE jobs set min_salary = 0 WHERE job_id = 'SA_REP';
</pre>
</div>
</div>

<div id="outline-container-orge268754" class="outline-2">
<h2 id="orge268754">Opgave 2</h2>
<div class="outline-text-2" id="text-orge268754">
<p>
Schrijf een database trigger waardoor bijgehouden wordt wie, wanneer,
welke bewerking (insert, update of delete) op de tabel job_history 
heeft uitgevoerd. Maak daarvoor de tabel log_history aan met de 
volgende kolommen: log_user, log_datum, log_tijd, log_actie. <br />
Bewaar als trigger_oef2.sql.
</p>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">TABLE</span> <span style="color: #A89984;">log_history</span>
(
  log_user VARCHAR2(30), 
  log_datum <span style="color: #66999D;">DATE</span>, 
  log_tijd <span style="color: #66999D;">TIMESTAMP</span>, 
  log_actie VARCHAR2(15)
);

<span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">OR</span> REPLACE <span style="color: #DD6F48;">TRIGGER</span> <span style="color: #A89984;">job_history_trigger</span>
   <span style="color: #DD6F48;">AFTER</span> <span style="color: #DD6F48;">INSERT</span> <span style="color: #DD6F48;">OR</span> <span style="color: #DD6F48;">UPDATE</span> <span style="color: #DD6F48;">OR</span> <span style="color: #DD6F48;">DELETE</span> <span style="color: #DD6F48;">ON</span> job_history
<span style="color: #DD6F48;">DECLARE</span>
   v_action VARCHAR2(15) ;
<span style="color: #DD6F48;">BEGIN</span>
  IF INSERTING <span style="color: #DD6F48;">THEN</span>
    v_action := <span style="color: #528B8B;">'INSERT'</span>;
  ELSIF UPDATING <span style="color: #DD6F48;">THEN</span>
    v_action := <span style="color: #528B8B;">'UPDATE'</span>;
  <span style="color: #DD6F48;">ELSE</span>
    v_action := <span style="color: #528B8B;">'DELETE'</span>;
  <span style="color: #DD6F48;">END</span> IF;

  <span style="color: #DD6F48;">INSERT</span> <span style="color: #DD6F48;">INTO</span> log_history
    <span style="color: #DD6F48;">VALUES</span>(
      <span style="color: #FE8019;">USER</span>, 
      SYSDATE,
      SYSTIMESTAMP, 
      v_action
    );     
  <span style="color: #DD6F48;">END</span>;
/
</pre>
</div>

<p>
<i>(Ik denk dat je tijdens het examen oefening best de create table buiten 
het bestand doet, of in een aparte sql-file zou ook kunnen.)</i>
</p>

<p>
<a href="../sql-files/triggers/trigger_oef2.sql">sql bestand</a>
</p>

<p>
Je kan de trigger functie testen via:
</p>
<pre class="example">
SQL&gt; INSERT INTO job_history VALUES(127, '14-JAN-99', SYSDATE, 'ST_CLERK', 50);
SQL&gt; SELECT * FROM job_history;
</pre>
</div>
</div>

<div id="outline-container-orgab774e6" class="outline-2">
<h2 id="orgab774e6">Opgave 3 WERKT NIET</h2>
<div class="outline-text-2" id="text-orgab774e6">
<p>
Schrijf een trigger die ervoor zorgt : 
</p>
<ul class="org-ul">
<li>dat maandlonen enkel op maandag tussen 9:00 en 17:00 kunnen aangepast worden.</li>
<li>dat in het weekend geen employees verwijderd of toegevoegd kunnen worden.</li>
</ul>

<p>
Bewaar als trigger_oef3.sql 
</p>

<p>
<span class="underline">Tip:</span> om de tijd uit de systeemdatum te halen gebruik je de functie to_char 
met als formaat 'hh24:mi:ss'.
</p>

<p>
<i>Denk er aan dat zondag dag 1 is in PLSQL.</i>
</p>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">OR</span> REPLACE <span style="color: #DD6F48;">TRIGGER</span> <span style="color: #A89984;">month_loan_trigger</span>
  <span style="color: #DD6F48;">BEFORE</span> 
    <span style="color: #DD6F48;">UPDATE</span> <span style="color: #DD6F48;">OF</span> salary
    <span style="color: #DD6F48;">OR</span> <span style="color: #DD6F48;">DELETE</span>
    <span style="color: #DD6F48;">OR</span> <span style="color: #DD6F48;">INSERT</span> <span style="color: #DD6F48;">ON</span> employees
<span style="color: #DD6F48;">DECLARE</span>
  v_hour varchar2(8);
<span style="color: #DD6F48;">BEGIN</span>
  IF DELETING <span style="color: #DD6F48;">OR</span> INSERTING <span style="color: #DD6F48;">THEN</span>
    IF 
      TO_CHAR(SYSDATE, <span style="color: #528B8B;">'D'</span>) = 7 
      <span style="color: #DD6F48;">OR</span> TO_CHAR(SYSDATE, <span style="color: #528B8B;">'D'</span>) = 1 
    <span style="color: #DD6F48;">THEN</span>
      RAISE_APPLICATION_ERROR(
        -20000, 
        <span style="color: #528B8B;">'Can'</span>t <span style="color: #DD6F48;">add</span> <span style="color: #DD6F48;">or</span> <span style="color: #DD6F48;">delete</span> salary during weekends.<span style="color: #528B8B;">'</span>
<span style="color: #528B8B;">      );</span>
<span style="color: #528B8B;">    END IF;</span>
<span style="color: #528B8B;">  ELSE</span>
<span style="color: #528B8B;">    v_hour := TO_CHAR(SYSDATE,'</span>hh24:mi:ss<span style="color: #528B8B;">');</span>
<span style="color: #528B8B;">    IF</span>
<span style="color: #528B8B;">      TO_CHAR(SYSDATE, '</span>d<span style="color: #528B8B;">') != 2 </span>
<span style="color: #528B8B;">      OR v_hour &lt; '</span>09:00:00<span style="color: #528B8B;">' </span>
<span style="color: #528B8B;">      OR v_hour &gt; '</span>17:00:00<span style="color: #528B8B;">'</span>
<span style="color: #528B8B;">    THEN</span>
<span style="color: #528B8B;">      RAISE_APPLICATION_ERROR(</span>
<span style="color: #528B8B;">        -20000,  </span>
<span style="color: #528B8B;">        '</span>Can<span style="color: #528B8B;">'t edit salary, '</span> || 
        <span style="color: #528B8B;">'can only edit during Mondays during 9:00 - 17:00'</span>
      );
    <span style="color: #DD6F48;">END</span> IF;
  <span style="color: #DD6F48;">END</span> IF;
  <span style="color: #DD6F48;">END</span>;
/
</pre>
</div>
<p>
<a href="../sql-files/triggers/trigger_oef3.sql">sql bestand</a>
</p>

<p>
Je kan de trigger functie testen via:
</p>
<pre class="example">
SQL&gt; DELETE FROM employees WHERE employee_id = 205;
SQL&gt; INSERT INTO employees (salary) VALUES (10000);
</pre>

<p>
<i>Het kan handig zijn om de systeemdatum van je PC tijdelijk te wijzigen.</i>
</p>

<p>
<a href="../index.html">Home</a> &gt; <a href="plsql.html">PLSQL</a> &gt; Triggers
</p>
</div>
</div>
