SEMESTER-2/Big Data/big-data-exercises-pxl.gitlab.io-master-public/public/plsql/triggers.org
** Opgave 4
Doe al het nodige om er voor te zorgen dat bij het wijzigen van het salaris 
van een of meerdere medewerkers de verhoging nooit meer mag zijn dan 5%: 
- melding indien meer dan 5%: "Een loonsverhoging van meer dan 5% is niet 
  toegelaten" 
- de verhoging mag niet doorgaan Een verlaging resulteert in een foutmelding 
  "Loonsverlaging kan niet!" en deze mag dus ook niet doorgaan.

Bewaar als trigger_oef4.sql

#+BEGIN_SRC plsql
CREATE OR REPLACE TRIGGER loan_raise_trigger
  AFTER UPDATE 
  OF salary 
  ON employees
  FOR EACH ROW
BEGIN
  IF :NEW.salary < :OLD.salary THEN
    RAISE_APPLICATION_ERROR(-20000,'Loonsverlaging kan niet!');
  ELSIF :NEW.salary > :OLD.salary*1.05 THEN
    RAISE_APPLICATION_ERROR(
      -20000,
      'Een loonsverhoging van meer dan 5% is niet toegelaten!'
    );
  END IF;
  END;
/
#+END_SRC

[[file:../sql-files/triggers/trigger_oef4.sql][sql bestand]]

Je kan de trigger functie testen via:
#+BEGIN_SRC
SQL> UPDATE employees SET salary=100000 WHERE employee_id = 206;
#+END_SRC

** Opgave 5
Pas de oplossing van oefening 4 zodanig aan dat deze trigger enkel werkt als 
het gaat om de medewerkers die aangeworven zijn vóór 01‐01‐1995. \\
Bewaar als trigger_oef5.sql.

#+BEGIN_SRC plsql
CREATE OR REPLACE TRIGGER loan_raise_trigger
  AFTER UPDATE 
  OF salary 
  ON employees
  FOR EACH ROW
  WHEN (OLD.hire_date < TO_DATE('01-01-1995','dd-mm-yyyy'))
BEGIN
  IF :NEW.salary < :OLD.salary THEN
    RAISE_APPLICATION_ERROR(-20000,'Loonsverlaging kan niet!');
  ELSIF :NEW.salary > :OLD.salary*1.05 THEN
    RAISE_APPLICATION_ERROR(
      -20000,
      'Een loonsverhoging van meer dan 5% is niet toegelaten!'
    );
  END IF;
  END;
/
#+END_SRC

[[file:../sql-files/triggers/trigger_oef5.sql][sql bestand]]

Je kan de trigger functie testen via:
#+BEGIN_SRC
SQL> UPDATE employees SET salary=100000 WHERE employee_id = 204;
#+END_SRC

** Opgave 6
Doe al het nodige om er voor te zorgen dat: 
- bij het toevoegen of wijzigen in de tabel employees het job_id automatisch
  naar hoofdletters wordt geconverteerd en de naam en voornaam enkel begint 
  met een hoofdletter
- bij het toevoegen bij de hire_date nooit een datum in het verleden kan
  worden ingegeven
- medewerkers die promoveren en een managersfunctie krijgen, automatisch een 
  salarisverhoging krijgen van 5%. Het moet wel degelijk om een promotie gaan. 
  Iemand die president of vice president was en manager wordt, krijgt geen 
  verhoging. Gebruik hiervoor het job_id.

Sla op als trigger_oef6.sql.

#+BEGIN_SRC plsql
CREATE OR REPLACE TRIGGER data_validation_trigger
  BEFORE INSERT 
  OR UPDATE 
  ON employees
  FOR EACH ROW
BEGIN
  :NEW.job_id := UPPER(:NEW.job_id);
  :NEW.first_name := INITCAP(:NEW.first_name);
  :NEW.last_name := INITCAP(:NEW.last_name);
  IF INSERTING THEN
    IF :NEW.hire_date < SYSDATE THEN
      raise_application_error(
        -20000,
        'Date can''t be in the past.'
      );
    END IF;
  END IF;
  IF UPDATING THEN
    IF 
      :NEW.job_id IN ('%MAN', '%MGR') 
      AND :OLD.job_id NOT IN ('AD_PRES', 'AD_VP') 
    THEN
      :NEW.salary := :OLD.salary*1.05;
    END IF;
  END IF;
  END;
/
#+END_SRC

[[file:../sql-files/triggers/trigger_oef6.sql][sql bestand]]

Je kan de trigger functie testen via:
#+BEGIN_SRC
SQL> INSERT INTO employees (hire_date) 
VALUES(TO_DATE('2003/05/03', 'yyyy/mm/dd'));
#+END_SRC

Naast dit kan je ook andere delen van de trigger testen via functies.
Je kan een select gebruiken om de rijen op te vragen.

