SEMESTER-2/Big Data/big-data-exercises-pxl.gitlab.io-master-public/public/plsql/triggers.html
<div id="outline-container-org0add6de" class="outline-2">
<h2 id="org0add6de">Opgave 4</h2>
<div class="outline-text-2" id="text-org0add6de">
<p>
Doe al het nodige om er voor te zorgen dat bij het wijzigen van het salaris 
van een of meerdere medewerkers de verhoging nooit meer mag zijn dan 5%: 
</p>
<ul class="org-ul">
<li>melding indien meer dan 5%: "Een loonsverhoging van meer dan 5% is niet 
toegelaten"</li>
<li>de verhoging mag niet doorgaan Een verlaging resulteert in een foutmelding 
"Loonsverlaging kan niet!" en deze mag dus ook niet doorgaan.</li>
</ul>

<p>
Bewaar als trigger_oef4.sql
</p>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">OR</span> REPLACE <span style="color: #DD6F48;">TRIGGER</span> <span style="color: #A89984;">loan_raise_trigger</span>
  <span style="color: #DD6F48;">AFTER</span> <span style="color: #DD6F48;">UPDATE</span> 
  <span style="color: #DD6F48;">OF</span> salary 
  <span style="color: #DD6F48;">ON</span> employees
  <span style="color: #DD6F48;">FOR</span> <span style="color: #DD6F48;">EACH</span> <span style="color: #66999D;">ROW</span>
<span style="color: #DD6F48;">BEGIN</span>
  IF :<span style="color: #DD6F48;">NEW</span>.salary &lt; :<span style="color: #DD6F48;">OLD</span>.salary <span style="color: #DD6F48;">THEN</span>
    RAISE_APPLICATION_ERROR(-20000,<span style="color: #528B8B;">'Loonsverlaging kan niet!'</span>);
  ELSIF :<span style="color: #DD6F48;">NEW</span>.salary &gt; :<span style="color: #DD6F48;">OLD</span>.salary*1.05 <span style="color: #DD6F48;">THEN</span>
    RAISE_APPLICATION_ERROR(
      -20000,
      <span style="color: #528B8B;">'Een loonsverhoging van meer dan 5% is niet toegelaten!'</span>
    );
  <span style="color: #DD6F48;">END</span> IF;
  <span style="color: #DD6F48;">END</span>;
/
</pre>
</div>

<p>
<a href="../sql-files/triggers/trigger_oef4.sql">sql bestand</a>
</p>

<p>
Je kan de trigger functie testen via:
</p>
<pre class="example">
SQL&gt; UPDATE employees SET salary=100000 WHERE employee_id = 206;
</pre>
</div>
</div>

<div id="outline-container-orgce837ed" class="outline-2">
<h2 id="orgce837ed">Opgave 5</h2>
<div class="outline-text-2" id="text-orgce837ed">
<p>
Pas de oplossing van oefening 4 zodanig aan dat deze trigger enkel werkt als 
het gaat om de medewerkers die aangeworven zijn vóór 01‐01‐1995. <br />
Bewaar als trigger_oef5.sql.
</p>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">OR</span> REPLACE <span style="color: #DD6F48;">TRIGGER</span> <span style="color: #A89984;">loan_raise_trigger</span>
  <span style="color: #DD6F48;">AFTER</span> <span style="color: #DD6F48;">UPDATE</span> 
  <span style="color: #DD6F48;">OF</span> salary 
  <span style="color: #DD6F48;">ON</span> employees
  <span style="color: #DD6F48;">FOR</span> <span style="color: #DD6F48;">EACH</span> <span style="color: #66999D;">ROW</span>
  <span style="color: #DD6F48;">WHEN</span> (<span style="color: #DD6F48;">OLD</span>.hire_date &lt; TO_DATE(<span style="color: #528B8B;">'01-01-1995'</span>,<span style="color: #528B8B;">'dd-mm-yyyy'</span>))
<span style="color: #DD6F48;">BEGIN</span>
  IF :<span style="color: #DD6F48;">NEW</span>.salary &lt; :<span style="color: #DD6F48;">OLD</span>.salary <span style="color: #DD6F48;">THEN</span>
    RAISE_APPLICATION_ERROR(-20000,<span style="color: #528B8B;">'Loonsverlaging kan niet!'</span>);
  ELSIF :<span style="color: #DD6F48;">NEW</span>.salary &gt; :<span style="color: #DD6F48;">OLD</span>.salary*1.05 <span style="color: #DD6F48;">THEN</span>
    RAISE_APPLICATION_ERROR(
      -20000,
      <span style="color: #528B8B;">'Een loonsverhoging van meer dan 5% is niet toegelaten!'</span>
    );
  <span style="color: #DD6F48;">END</span> IF;
  <span style="color: #DD6F48;">END</span>;
/
</pre>
</div>

<p>
<a href="../sql-files/triggers/trigger_oef5.sql">sql bestand</a>
</p>

<p>
Je kan de trigger functie testen via:
</p>
<pre class="example">
SQL&gt; UPDATE employees SET salary=100000 WHERE employee_id = 204;
</pre>
</div>
</div>

<div id="outline-container-orgd0306ec" class="outline-2">
<h2 id="orgd0306ec">Opgave 6</h2>
<div class="outline-text-2" id="text-orgd0306ec">
<p>
Doe al het nodige om er voor te zorgen dat: 
</p>
<ul class="org-ul">
<li>bij het toevoegen of wijzigen in de tabel employees het job_id automatisch
naar hoofdletters wordt geconverteerd en de naam en voornaam enkel begint 
met een hoofdletter</li>
<li>bij het toevoegen bij de hire_date nooit een datum in het verleden kan
worden ingegeven</li>
<li>medewerkers die promoveren en een managersfunctie krijgen, automatisch een 
salarisverhoging krijgen van 5%. Het moet wel degelijk om een promotie gaan. 
Iemand die president of vice president was en manager wordt, krijgt geen 
verhoging. Gebruik hiervoor het job_id.</li>
</ul>

<p>
Sla op als trigger_oef6.sql.
</p>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">OR</span> REPLACE <span style="color: #DD6F48;">TRIGGER</span> <span style="color: #A89984;">data_validation_trigger</span>
  <span style="color: #DD6F48;">BEFORE</span> <span style="color: #DD6F48;">INSERT</span> 
  <span style="color: #DD6F48;">OR</span> <span style="color: #DD6F48;">UPDATE</span> 
  <span style="color: #DD6F48;">ON</span> employees
  <span style="color: #DD6F48;">FOR</span> <span style="color: #DD6F48;">EACH</span> <span style="color: #66999D;">ROW</span>
<span style="color: #DD6F48;">BEGIN</span>
  :<span style="color: #DD6F48;">NEW</span>.job_id := <span style="color: #FE8019;">UPPER</span>(:<span style="color: #DD6F48;">NEW</span>.job_id);
  :<span style="color: #DD6F48;">NEW</span>.first_name := INITCAP(:<span style="color: #DD6F48;">NEW</span>.first_name);
  :<span style="color: #DD6F48;">NEW</span>.last_name := INITCAP(:<span style="color: #DD6F48;">NEW</span>.last_name);
  IF INSERTING <span style="color: #DD6F48;">THEN</span>
    IF :<span style="color: #DD6F48;">NEW</span>.hire_date &lt; SYSDATE <span style="color: #DD6F48;">THEN</span>
      raise_application_error(
        -20000,
        <span style="color: #528B8B;">'Date can''t be in the past.'</span>
      );
    <span style="color: #DD6F48;">END</span> IF;
  <span style="color: #DD6F48;">END</span> IF;
  IF UPDATING <span style="color: #DD6F48;">THEN</span>
    IF 
      :<span style="color: #DD6F48;">NEW</span>.job_id <span style="color: #DD6F48;">IN</span> (<span style="color: #528B8B;">'%MAN'</span>, <span style="color: #528B8B;">'%MGR'</span>) 
      <span style="color: #DD6F48;">AND</span> :<span style="color: #DD6F48;">OLD</span>.job_id <span style="color: #DD6F48;">NOT</span> <span style="color: #DD6F48;">IN</span> (<span style="color: #528B8B;">'AD_PRES'</span>, <span style="color: #528B8B;">'AD_VP'</span>) 
    <span style="color: #DD6F48;">THEN</span>
      :<span style="color: #DD6F48;">NEW</span>.salary := :<span style="color: #DD6F48;">OLD</span>.salary*1.05;
    <span style="color: #DD6F48;">END</span> IF;
  <span style="color: #DD6F48;">END</span> IF;
  <span style="color: #DD6F48;">END</span>;
/
</pre>
</div>

<p>
<a href="../sql-files/triggers/trigger_oef6.sql">sql bestand</a>
</p>

<p>
Je kan de trigger functie testen via:
</p>
<pre class="example">
SQL&gt; INSERT INTO employees (hire_date) 
VALUES(TO_DATE('2003/05/03', 'yyyy/mm/dd'));
</pre>

<p>
Naast dit kan je ook andere delen van de trigger testen via functies.
Je kan een select gebruiken om de rijen op te vragen.
</p>
</div>
</div>
