SEMESTER-2/Big Data/big-data-exercises-pxl.gitlab.io-master-public/public/plsql/triggers.org
** Opgave 7 NIET DEFTIG GETEST

Zorg ervoor dat bij de creatie van een nieuwe employee volgende controles 
gebeuren: 
- als geen manager_id wordt ingevoerd, wordt automatisch de manager van het
  departement waar deze persoon aan toegewezen wordt, de directe chef. Toon 
  in dat geval als melding op het scherm "de chef wordt [de naam en de 
  voornaam van de chef]."
- als er geen hire_date werd ingevuld dan wordt dit automatisch de 
  eerstvolgende maandag na de huidige datum. 
- als geen salary werd opgegeven, wordt dit automatisch 1000. Druk in dat 
  geval af "het salaris van employee [naam employee] wordt 1000".

Als een employee verwijderd wordt, verschijnt een melding 
"dit is per maand een besparing van [/xxx/] euro", (waarbij je de /xxx/ 
vervangtdoor het maandloon van deze employee). \\
Bewaar als trigger_oef7.sql.

#+BEGIN_SRC plsql
CREATE OR REPLACE TRIGGER data_validation_trigger
  BEFORE 
    INSERT OR DELETE 
           ON employees
           FOR EACH ROW
  DECLARE
    v_manager_id departments.manager_id%TYPE;
    v_firstname employees.first_Name%TYPE;
    v_name employees.last_name%TYPE;
 
  BEGIN
  IF INSERTING THEN
    IF :NEW.manager_id IS NULL THEN
      SELECT manager_id
      INTO v_manager_id
      FROM departments
      WHERE department_id = :NEW.department_id;
      
      SELECT first_name, last_name
      INTO v_firstname, v_name
      FROM employees
      WHERE employee_id = v_manager_id;

      :NEW.manager_id := v_manager_id;
      DBMS_OUTPUT.PUT_LINE(
        'de chef wordt ' ||
        v_name || 
        ' ' || 
        v_firstname
      );
    END IF;

    IF :NEW.hire_date IS NULL THEN
      :NEW.hire_date := NEXT_DAY(SYSDATE, 'MONDAY');
    END IF;
 
    IF :NEW.salary IS NULL THEN
      :NEW.salary := 1000;
      DBMS_OUTPUT.PUT_LINE(
        'het salaris van employee ' || 
        :NEW.last_name || 
        ' wordt 1000.'
      );
    END IF;
 
  ELSIF DELETING THEN
    DBMS_OUTPUT.PUT_LINE(
      'dit is per maand een besparing van ' || 
      :OLD.salary || 
      ' euro.'
    );
  END IF;
  END;
/
#+END_SRC

[[file:../sql-files/triggers/trigger_oef7.sql][sql bestand]]

Je kan de trigger functie testen via:
#+BEGIN_SRC
SQL> DELETE FROM employees WHERE employee_id = 206;
#+END_SRC

[[file:../index.org][Home]] > [[file:plsql.org][PLSQL]] > Triggers
