SEMESTER-2/Big Data/big-data-exercises-pxl.gitlab.io-master-public/public/plsql/triggers.html

<div id="outline-container-org8ded561" class="outline-2">
<h2 id="org8ded561">Opgave 7 NIET DEFTIG GETEST</h2>
<div class="outline-text-2" id="text-org8ded561">
<p>
Zorg ervoor dat bij de creatie van een nieuwe employee volgende controles 
gebeuren: 
</p>
<ul class="org-ul">
<li>als geen manager_id wordt ingevoerd, wordt automatisch de manager van het
departement waar deze persoon aan toegewezen wordt, de directe chef. Toon 
in dat geval als melding op het scherm "de chef wordt [de naam en de 
voornaam van de chef]."</li>
<li>als er geen hire_date werd ingevuld dan wordt dit automatisch de 
eerstvolgende maandag na de huidige datum.</li>
<li>als geen salary werd opgegeven, wordt dit automatisch 1000. Druk in dat 
geval af "het salaris van employee [naam employee] wordt 1000".</li>
</ul>

<p>
Als een employee verwijderd wordt, verschijnt een melding 
"dit is per maand een besparing van [/xxx/] euro", (waarbij je de <i>xxx</i> 
vervangtdoor het maandloon van deze employee). <br />
Bewaar als trigger_oef7.sql.
</p>

<div class="org-src-container">
<pre class="src src-plsql"><span style="color: #DD6F48;">CREATE</span> <span style="color: #DD6F48;">OR</span> REPLACE <span style="color: #DD6F48;">TRIGGER</span> <span style="color: #A89984;">data_validation_trigger</span>
  <span style="color: #DD6F48;">BEFORE</span> 
    <span style="color: #DD6F48;">INSERT</span> <span style="color: #DD6F48;">OR</span> <span style="color: #DD6F48;">DELETE</span> 
           <span style="color: #DD6F48;">ON</span> employees
           <span style="color: #DD6F48;">FOR</span> <span style="color: #DD6F48;">EACH</span> <span style="color: #66999D;">ROW</span>
  <span style="color: #DD6F48;">DECLARE</span>
    v_manager_id departments.manager_id%<span style="color: #DD6F48;">TYPE</span>;
    v_firstname employees.first_Name%<span style="color: #DD6F48;">TYPE</span>;
    v_name employees.last_name%<span style="color: #DD6F48;">TYPE</span>;

  <span style="color: #DD6F48;">BEGIN</span>
  IF INSERTING <span style="color: #DD6F48;">THEN</span>
    IF :<span style="color: #DD6F48;">NEW</span>.manager_id <span style="color: #DD6F48;">IS</span> <span style="color: #DD6F48;">NULL</span> <span style="color: #DD6F48;">THEN</span>
      <span style="color: #DD6F48;">SELECT</span> manager_id
      <span style="color: #DD6F48;">INTO</span> v_manager_id
      <span style="color: #DD6F48;">FROM</span> departments
      <span style="color: #DD6F48;">WHERE</span> department_id = :<span style="color: #DD6F48;">NEW</span>.department_id;

      <span style="color: #DD6F48;">SELECT</span> first_name, last_name
      <span style="color: #DD6F48;">INTO</span> v_firstname, v_name
      <span style="color: #DD6F48;">FROM</span> employees
      <span style="color: #DD6F48;">WHERE</span> employee_id = v_manager_id;

      :<span style="color: #DD6F48;">NEW</span>.manager_id := v_manager_id;
      DBMS_OUTPUT.PUT_LINE(
        <span style="color: #528B8B;">'de chef wordt '</span> ||
        v_name || 
        <span style="color: #528B8B;">' '</span> || 
        v_firstname
      );
    <span style="color: #DD6F48;">END</span> IF;

    IF :<span style="color: #DD6F48;">NEW</span>.hire_date <span style="color: #DD6F48;">IS</span> <span style="color: #DD6F48;">NULL</span> <span style="color: #DD6F48;">THEN</span>
      :<span style="color: #DD6F48;">NEW</span>.hire_date := NEXT_DAY(SYSDATE, <span style="color: #528B8B;">'MONDAY'</span>);
    <span style="color: #DD6F48;">END</span> IF;

    IF :<span style="color: #DD6F48;">NEW</span>.salary <span style="color: #DD6F48;">IS</span> <span style="color: #DD6F48;">NULL</span> <span style="color: #DD6F48;">THEN</span>
      :<span style="color: #DD6F48;">NEW</span>.salary := 1000;
      DBMS_OUTPUT.PUT_LINE(
        <span style="color: #528B8B;">'het salaris van employee '</span> || 
        :<span style="color: #DD6F48;">NEW</span>.last_name || 
        <span style="color: #528B8B;">' wordt 1000.'</span>
      );
    <span style="color: #DD6F48;">END</span> IF;

  ELSIF DELETING <span style="color: #DD6F48;">THEN</span>
    DBMS_OUTPUT.PUT_LINE(
      <span style="color: #528B8B;">'dit is per maand een besparing van '</span> || 
      :<span style="color: #DD6F48;">OLD</span>.salary || 
      <span style="color: #528B8B;">' euro.'</span>
    );
  <span style="color: #DD6F48;">END</span> IF;
  <span style="color: #DD6F48;">END</span>;
/
</pre>
</div>

<p>
<a href="../sql-files/triggers/trigger_oef7.sql">sql bestand</a>
</p>

<p>
Je kan de trigger functie testen via:
</p>
<pre class="example">
SQL&gt; DELETE FROM employees WHERE employee_id = 206;
</pre>

<p>
<a href="../index.html">Home</a> &gt; <a href="plsql.html">PLSQL</a> &gt; Triggers
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Robin Wils</p>
<p class="date">Created: 2019-08-14 Wed 16:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
